data = '[{"question" : "Does your partner Isolate you from friends and family, deprive you of basic needs, such as food, or monitor your time?", "result" : "This is called Coercive Control. This controlling behavior is designed to make a person dependent by isolating them from support, exploiting them, depriving them of independence and regulating their everyday behavior."},{"question" : "Does your partner threaten to withhold money, disconnect the phone and internet, take away or destroy your mobile phone, tablet or laptop, take the car away, take the children away; threaten to report you to the police, social services or the mental health team unless you comply with their demands?", "result" : "These are Pressure Tactics, and are designed to control your behavior, isolate your from information and connections that could help you, and make you afraid to behave in any fashion that takes control away from your partner."},{"question" : "Does your partner lie to you, withhold information from you, act jealous, have other relationships, or break promises and shared agreements?", "result" : "This is Breaking Trust. These behaviors are symptoms of a partner that does not treat you with the respect and honesty you should expect from a loving mate. While no relationship can expect 100% honesty at all times, if these behaviors sound familiar and your partner exhibits them frequently, it\'s a red flag."},{"question" : "Does your partner monitor or block your phone calls, e-mails and social media accounts, tell you where you can and cannot go, prevent you from seeing friends and relatives, or shut you in the house?", "result" : "This is called Isolation. It\'s a tactic to keep you away from those who would help you, and prevent you from communicating openly or getting information without your partner\'s knowledge. A trusting partner would never need to have this amount of control, and isolation is never healthy. "},{"question" : "If you are experiencing physical abuse, does your partner ever say the abuse doesn\'t happen, that you caused the abuse, that you wind them up, that they can\'t control their anger, that it will never happen again?", "result" : "This is Denial. It\'s a method abusers use to make their victims feel responsible, and continue the cycle of violence by promising to do better and to change, while their actual goal is to keep you in the relationship so their control can continue."}]';